{"_id":{"$oid":"6406cd019bf833f76363687d"},"Title":"12 Strong","Description":"In the wake of the September 11 attacks, Captain Mitch Nelson leads a US Special Forces team into Afghanistan for an extremely dangerous mission.","Genre":{"Name":"Action","Description":" Action film is a film genre in which the protagonist is thrust into a series of events that typically involes violence and physical feats."},"Director":{"Name":"Nicolai Fuglsig","Bio":"Nicolai Fuglsig is a Danish film director and photojournalist.","Birth":"1972"},"ImagePath":"https://www2.pictures.gi.zimbio.com/60th+Annual+DGA+Awards+Press+Room+IbIk9KmbnE_x.jpg","Featured":true}
{"_id":{"$oid":"6406cde89bf833f76363687e"},"Title":"13 Hours","Description":"On Sept. 11, 2012, Islamic militants attack the U.S. Consulate in Benghazi, Libya, killing Ambassador J. Christopher Stevens and Sean Smith, an officer for the Foreign Service. Stationed less than one mile away are members of the Annex Security Team, former soldiers assigned to protect operatives and diplomats in the city. As the assault rages on, the six men engage the combatants in a fierce firefight to save the lives of the remaining Americans.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Michael Bay","Bio":"Michael Benjamin Bay is an American film director and producer. He is best known for directing high-budget action films characterized by fast edits, polished visuals and substantial use of practical effects.","Birth":"1965 Los Angeles, California"},"ImagePath":"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2023%2F01%2F13%2FMichael-Bay-Pigeon-Italy-01-011223.jpg","Featured":true,"Bio":"Michael Bay is an American film director and producer best known for making big budget, high concept action films."}
{"_id":{"$oid":"6406d0a79bf833f76363687f"},"Title":"American Sniper","Description":"Chris Kyle a Navy S.E.A.L. sniper saves many lives on the battle field but his hardest battle is with himself back home.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Clint Eastwood","Bio":"Clinton Eastwood Jr. is an American actor and film director. After achieving success in the Western TV series Rawhide, he rose to international fame with his role as the 'Man with No Name' in Sergio Leone's 'Dollars Trilogy' of Spaghetti Westerns during the mid-1960s and as antihero cop Harry Callahan in the five Dirty Harry films throughout the 1970s and 1980s.","Birth":"1930 San Francisco, California"},"ImagePath":"https://cdn.britannica.com/75/152975-050-99123EE6/Clint-Eastwood-2008.jpg","Featured":true,"Bio":"Clint Eastwood is an American film director and actor. He started his career staring in West films during the 1960s and 1980s and was an Academy Award nominee for Best Actor in 1992."}
{"_id":{"$oid":"6406d2469bf833f763636880"},"Title":"Letters from Iwo Jima","Description":"Long-buried missives from the island reveal the stories of the Japanese troops who fought and died there during World War II.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Clint Eastwood","Bio":"Clinton Eastwood Jr. is an American actor and film director. After achieving success in the Western TV series Rawhide, he rose to international fame with his role as the 'Man with No Name' in Sergio Leone's 'Dollars Trilogy' of Spaghetti Westerns during the mid-1960s and as antihero cop Harry Callahan in the five Dirty Harry films throughout the 1970s and 1980s.","Birth":"1930 San Francisco, California"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTkxNzI3ODI4Nl5BMl5BanBnXkFtZTgwMjkwMjY4MjE@._V1_.jpg","Featured":true}
{"_id":{"$oid":"6406d58f9bf833f763636881"},"Title":"Flags of Our Fathers","Description":"In February and March of 1945, U.S. troops fight and win one of the most crucial and costly battles of the war on the island of Iwo Jima. A photo of U.S. servicemen raising the flag on Mount Suribachi becomes an iconic symbol of victory to a war-weary nation. The individuals themselves become heroes, though not all survive the war and realize it.","Genre":{"Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Clint Eastwood","Bio":"Clinton Eastwood Jr. is an American actor and film director. After achieving success in the Western TV series Rawhide, he rose to international fame with his role as the 'Man with No Name' in Sergio Leone's 'Dollars Trilogy' of Spaghetti Westerns during the mid-1960s and as antihero cop Harry Callahan in the five Dirty Harry films throughout the 1970s and 1980s.","Birth":"1930 San Francisco, California"},"ImagePath":"https://static.wikia.nocookie.net/cinemorgue/images/7/74/Flags-of-our-Fathers_1.jpg/revision/latest/scale-to-width-down/401?cb=20170223011430","Featured":true}
{"_id":{"$oid":"6406d71a9bf833f763636882"},"Title":"Hacksaw Ridge","Description":"The true story of Pfc. Desmond T. Doss (Andrew Garfield), who won the Congressional Medal of Honor despite refusing to bear arms during WWII on religious grounds. Doss was drafted and ostracized by fellow soldiers for his pacifist stance but went on to earn respect and adoration for his bravery, selflessness and compassion after he risked his life -- without firing a shot -- to save 75 men in the Battle of Okinawa.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Mel Gibson","Bio":"Mel Colmcille Gerard Gibson was born on January 3, 1956, in Peekskill, New York. He was the sixth of 11 children of Hutton and Ann Gibson, Roman Catholics of Irish descent. Shortly after the onset of the Vietnam War, Hutton Gibson relocated his family to Australia for fear that his sons would be drafted into battle.","Birth":"1956 Peekskill, New York"},"ImagePath":"https://img3.hulu.com/user/v3/artwork/c966e511-edbd-4f3b-929f-70c2fdb052f2?base_image_bucket_name=image_manager&base_image=ef02dd84-4c3c-4976-8bd6-0466b87b70cf&region=US&format=jpeg&size=952x536","Featured":true}
{"_id":{"$oid":"6406d8cb9bf833f763636883"},"Title":"Fury","Description":"In April 1945, the Allies are making their final push in the European theater. A battle-hardened Army sergeant named Don Collier, leading a Sherman tank and a five-man crew, undertakes a deadly mission behind enemy lines. Hopelessly outnumbered, outgunned and saddled with an inexperienced soldier in their midst, Wardaddy and his men face overwhelming odds as they move to strike at the heart of Nazi Germany.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"David Ayer","Bio":"David Ayer is an American filmmaker known for making crime films that are set in Los Angeles and deal with gangs and police corruption.","Birth":"1968"},"ImagePath":"https://www.sonypictures.com/sites/default/files/styles/max_560x840/public/title-key-art/furty_onesheet_1400x2100.png?itok=h-B-1RCp","Featured":true}
{"_id":{"$oid":"6406d9bb9bf833f763636884"},"Title":"Midway","Description":"On Dec. 7, 1941, Japanese forces launch a devastating attack on Pearl Harbor, the U.S. naval base in Hawaii. Six months later, the Battle of Midway commences on June 4, 1942, as the Japanese navy once again plans a strike against American ships in the Pacific. For the next three days, the U.S. Navy and a squad of brave fighter pilots engage the enemy in one of the most important and decisive battles of World War II.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Roland Emmerich","Bio":"Roland Emmerich is a German film director, screenwriter, and producer. He is widely known for his science fiction and disaster films and has been called a master of disaster within the industry.","Birth":"1955 Stuttgart, Germany"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNzQ2MGM0YjUtOWIxZC00YTI3LTgwNGUtMDFiYjAyMGYxNTNkXkEyXkFqcGdeQXVyMTA4NjE0NjEy._V1_.jpg","Featured":true}
{"_id":{"$oid":"6406da9e9bf833f763636885"},"Title":"Dunkirk","Description":"In May 1940, Germany advanced into France, trapping Allied troops on the beaches of Dunkirk. Under air and ground cover from British and French forces, troops were slowly and methodically evacuated from the beach using every serviceable naval and civilian vessel that could be found. At the end of this heroic mission, 330,000 French, British, Belgian and Dutch soldiers were safely evacuated.","Genre":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British film director and writer acclaimed for his noirish visual aesthetic and unconventional, often highly conceptual narratives. Nolan was raised by an American mother and a British father, and his family spent time in both Chicago and London.","Birth":"1970 London,England"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMmE0ZmUzYzUtMzE5Ni00OGM4LWJhMjEtOWZmYWQwYzA5NDM5XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_.jpg","Featured":true}
{"_id":{"$oid":"6406db899bf833f763636886"},"Title":"The Imitation Game","Description":"In 1939, newly created British intelligence agency MI6 recruits Cambridge mathematics alumnus Alan Turing (Benedict Cumberbatch) to crack Nazi codes, including Enigma -- which cryptanalysts had thought unbreakable. Turing's team, including Joan Clarke, analyze Enigma messages while he builds a machine to decipher them. Turing and team finally succeed and become heroes, but in 1952, the quiet genius encounters disgrace when authorities reveal he is gay and send him to prison.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Morten Tyldum","Bio":"Morten Tyldumis a Norwegian film director. He is best known for directing internationally successful films such as Headhunters (2011), a thriller based on a novel by Jo Nesbø and The Imitation Game (2014), a historical drama for which he was nominated for the Academy Award for Best Director.","Birth":"1967 Bergen,Norway"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BOTgwMzFiMWYtZDhlNS00ODNkLWJiODAtZDVhNzgyNzJhYjQ4L2ltYWdlXkEyXkFqcGdeQXVyNzEzOTYxNTQ@._V1_.jpg","Featured":true}
